/* Error detail string */
"An unknown error occurred" = "An unknown error occurred";

/* Error detail string */
"Archive has a corrupt header" = "Archive has a corrupt header";

/* Error detail string */
"Buffer too small to contain entire comments" = "Buffer too small to contain entire comments";

/* Error detail string */
"Error encountered while closing the archive" = "Error encountered while closing the archive";

/* Error detail string */
"Error encountered while reading the archive" = "Error encountered while reading the archive";

/* Error detail string */
"Error encountered while writing a file to disk" = "Error encountered while writing a file to disk";

/* Error detail string */
"Failed to create the target directory for extraction" = "Failed to create the target directory for extraction";

/* Error detail string */
"Failed to open a reference to the file" = "Failed to open a reference to the file";

/* Error detail string */
"File is not a valid RAR archive" = "File is not a valid RAR archive";

/* Error detail string */
"No password given to unlock a protected archive" = "No password given to unlock a protected archive";

/* Error detail string */
"Ran out of memory while reading archive" = "Ran out of memory while reading archive";

/* Error detail string */
"RAR headers encrypted in unknown format" = "RAR headers encrypted in unknown format";

/* Error detail string */
"Unable to find the archive" = "Unable to find the archive";

/* Error detail string */
"Unknown error encountered (code %ld)" = "Unknown error encountered (code %ld)";

/* Error detail string */
"User cancelled the operation in progress" = "User cancelled the operation in progress";

